### python과 mysql 연동
1. 외부 라이브러리 설치 (pymysql)
2. 라이브러리 로드
3. sql 서버의 정보 등록
    - 서버의 주소 (localhost)
    - 서버의 포트 번호(3306)
    - sql 유저의 아이디 (root)
    - sql 유저의 패스워드 (1234)
    - 사용할 데이터 베이스 명 (ubion)
4. sql 서버 접속
5. sql 쿼리문을 변수에 저장
6. 쿼리문을 sql 서버에 요청
7. 쿼리문에 따라서 응답 메시지를 확인
    - select문인 경우 응답 메시지를 받아서 데이터프레임으로 변환
8. sql 서버와의 연결을 종료

In [1]:
import pandas as pd
import pymysql
import os
import dotenv

In [2]:
dotenv.load_dotenv()

True

In [3]:
os.getenv('host')

'127.0.0.1'

In [4]:
# 서버의 정보와 접속
# pymysql lib 안에 함수를 호출
# connect(host = 서버의 주소, port = 포트번호, user = 유저id,
#         password = 유저 비밀번호, db = 사용할 데이터베이스명 )
_db = pymysql.connect(
    host = os.getenv('host'),
    port = int(os.getenv('port')),
    user = os.getenv('user'),
    password = os.getenv('password'),
    db = os.getenv('db')
    )

In [5]:
# 쿼리문 작성
select_sql = '''
    SELECT *
    FROM `sales records`
    limit 5
'''

In [6]:
# 커서(Cursor) 생성

# 기본값으로 커서 생성 : select문의 응답 데이터의 타입이 2차원 튜플
cursor = _db.cursor()

# DictCursor 사용 : select문의 응답 데이터 타입이 리스트 안에 딕셔너리 형태 2차원 데이터
cursor2 = _db.cursor(pymysql.cursors.DictCursor)

In [7]:
# 커서에 sql 질의를 보냄
cursor.execute(select_sql)
cursor2.execute(select_sql)

5

In [8]:
# 커서에 보낸 질의에 대한 응답을 받는다.
# fetchall()
print(cursor.fetchall())

(('Sub-Saharan Africa', 'Chad', 'Office Supplies', 'Online', 'L', '1/27/2011', 292494523, '2/12/2011', 4484, 651.21, 524.96, 2920025.64, 2353920.64, 566105.0), ('Europe', 'Latvia', 'Beverages', 'Online', 'C', '12/28/2015', 361825549, '1/23/2016', 1075, 47.45, 31.79, 51008.75, 34174.25, 16834.5), ('Middle East and North Africa', 'Pakistan', 'Vegetables', 'Offline', 'C', '1/13/2011', 141515767, '2/1/2011', 6515, 154.06, 90.93, 1003700.9, 592408.95, 411291.95), ('Sub-Saharan Africa', 'Democratic Republic of the Congo', 'Household', 'Online', 'C', '9/11/2012', 500364005, '10/6/2012', 7683, 668.27, 502.54, 5134318.41, 3861014.82, 1273303.59), ('Europe', 'Czech Republic', 'Beverages', 'Online', 'C', '10/27/2015', 127481591, '12/5/2015', 3491, 47.45, 31.79, 165647.95, 110978.89, 54669.06))

In [9]:
print(cursor2.fetchall())

[{'Region': 'Sub-Saharan Africa', 'Country': 'Chad', 'Item Type': 'Office Supplies', 'Sales Channel': 'Online', 'Order Priority': 'L', 'Order Date': '1/27/2011', 'Order ID': 292494523, 'Ship Date': '2/12/2011', 'Units Sold': 4484, 'Unit Price': 651.21, 'Unit Cost': 524.96, 'Total Revenue': 2920025.64, 'Total Cost': 2353920.64, 'Total Profit': 566105.0}, {'Region': 'Europe', 'Country': 'Latvia', 'Item Type': 'Beverages', 'Sales Channel': 'Online', 'Order Priority': 'C', 'Order Date': '12/28/2015', 'Order ID': 361825549, 'Ship Date': '1/23/2016', 'Units Sold': 1075, 'Unit Price': 47.45, 'Unit Cost': 31.79, 'Total Revenue': 51008.75, 'Total Cost': 34174.25, 'Total Profit': 16834.5}, {'Region': 'Middle East and North Africa', 'Country': 'Pakistan', 'Item Type': 'Vegetables', 'Sales Channel': 'Offline', 'Order Priority': 'C', 'Order Date': '1/13/2011', 'Order ID': 141515767, 'Ship Date': '2/1/2011', 'Units Sold': 6515, 'Unit Price': 154.06, 'Unit Cost': 90.93, 'Total Revenue': 1003700.9, 'Total Cost': 592408.95, 'Total Profit': 411291.95}, {'Region': 'Sub-Saharan Africa', 'Country': 'Democratic Republic of the Congo', 'Item Type': 'Household', 'Sales Channel': 'Online', 'Order Priority': 'C', 'Order Date': '9/11/2012', 'Order ID': 500364005, 'Ship Date': '10/6/2012', 'Units Sold': 7683, 'Unit Price': 668.27, 'Unit Cost': 502.54, 'Total Revenue': 5134318.41, 'Total Cost': 3861014.82, 'Total Profit': 1273303.59}, {'Region': 'Europe', 'Country': 'Czech Republic', 'Item Type': 'Beverages', 'Sales Channel': 'Online', 'Order Priority': 'C', 'Order Date': '10/27/2015', 'Order ID': 127481591, 'Ship Date': '12/5/2015', 'Units Sold': 3491, 'Unit Price': 47.45, 'Unit Cost': 31.79, 'Total Revenue': 165647.95, 'Total Cost': 110978.89, 'Total Profit': 54669.06}]

In [10]:
cursor.execute(select_sql)
sql_data = cursor.fetchall()

In [11]:
sql_data

(('Sub-Saharan Africa',
  'Chad',
  'Office Supplies',
  'Online',
  'L',
  '1/27/2011',
  292494523,
  '2/12/2011',
  4484,
  651.21,
  524.96,
  2920025.64,
  2353920.64,
  566105.0),
 ('Europe',
  'Latvia',
  'Beverages',
  'Online',
  'C',
  '12/28/2015',
  361825549,
  '1/23/2016',
  1075,
  47.45,
  31.79,
  51008.75,
  34174.25,
  16834.5),
 ('Middle East and North Africa',
  'Pakistan',
  'Vegetables',
  'Offline',
  'C',
  '1/13/2011',
  141515767,
  '2/1/2011',
  6515,
  154.06,
  90.93,
  1003700.9,
  592408.95,
  411291.95),
 ('Sub-Saharan Africa',
  'Democratic Republic of the Congo',
  'Household',
  'Online',
  'C',
  '9/11/2012',
  500364005,
  '10/6/2012',
  7683,
  668.27,
  502.54,
  5134318.41,
  3861014.82,
  1273303.59),
 ('Europe',
  'Czech Republic',
  'Beverages',
  'Online',
  'C',
  '10/27/2015',
  127481591,
  '12/5/2015',
  3491,
  47.45,
  31.79,
  165647.95,
  110978.89,
  54669.06))

In [12]:
pd.DataFrame(sql_data)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,1/13/2011,141515767,2/1/2011,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,9/11/2012,500364005,10/6/2012,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,10/27/2015,127481591,12/5/2015,3491,47.45,31.79,165647.95,110978.89,54669.06

In [13]:
cursor2.execute(select_sql)
sql_data2 = cursor2.fetchall()

In [14]:
pd.DataFrame(sql_data2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,1/13/2011,141515767,2/1/2011,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,9/11/2012,500364005,10/6/2012,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,10/27/2015,127481591,12/5/2015,3491,47.45,31.79,165647.95,110978.89,54669.06

In [15]:
insert_sql = '''
    INSERT INTO 
    `user`
    VALUES
    ('test10','0011','choi',25)
'''

In [16]:
cursor2.execute(insert_sql)

IntegrityError: (1062, "Duplicate entry 'test10' for key 'user.PRIMARY'")

In [18]:
select_sql2 = '''
    SELECT
    *
    FROM
    `user`
'''
cursor2.execute(select_sql2)
cursor2.fetchall()

[{'id': 'test', 'password': '1234', 'name': 'kim', 'age': 20},
 {'id': 'test10', 'password': '0011', 'name': 'choi', 'age': 25},
 {'id': 'test11', 'password': '0123', 'name': 'kim', 'age': 35},
 {'id': 'test2', 'password': '1111', 'name': 'park', 'age': 30},
 {'id': 'test3', 'password': '0000', 'name': 'lee', 'age': 40},
 {'id': 'test4', 'password': '12345', 'name': 'kim', 'age': 35}]

In [19]:
_db.commit()

- select 함수 생성
    1. 매개변수 1개 (sql) 쿼리
    2. sql 쿼리를 cursor2에 보내는 부분
    3. cursor에서 응답 데이터를 변수에 저장
    4. 3번 과정의 결과를 데이터프레임으로 생성
    5. 데이터프레임을 되돌려준다.

In [20]:
def select_query(_sql):
    # _sql 커서에 질의 보내기
    cursor2 = _db.cursor()
    cursor2.execute(_sql)
    # cursor2에서 응답 데이터를 변수에 저장
    sql_data = cursor2.fetchall()
    # 데이터프레임으로 변경
    df = pd.DataFrame(sql_data)
    # 결과 되돌려줌
    return df
    
    
    
test_sql = "select * from `user`"
select_query(test_sql)

        0      1     2   3
0    test   1234   kim  20
1  test10   0011  choi  25
2  test11   0123   kim  35
3   test2   1111  park  30
4   test3   0000   lee  40
5   test4  12345   kim  35

In [21]:
# 매개변수가 2개인 함수 : insert, update, delete 
# 첫번째 매개변수 : sql 쿼리문
# 두번째 매개변수 : 데이터베이스를 수정할 것인가?(bool)
def cud_query(_sql,_inplace=False):
    # _sql cursor2에 질의 전송
    cursor2 = _db.cursor()
    cursor2.execute(_sql)
    # inplace가 True인 경우에 _db를 동기화 - _db.commit()
    if _inplace:
        _db.commit()
    return "Query OK"

In [22]:
insert_sql2 = '''
    insert into `user`
    values('test11','0123','kim',35)
'''

cud_query(insert_sql2)

IntegrityError: (1062, "Duplicate entry 'test11' for key 'user.PRIMARY'")

In [23]:
_db.commit()

In [25]:
update_sql = '''
    update `user` 
    set `password` = '123456789'
    where `id` ='test'
'''
cud_query(update_sql,True)

'Query OK'

In [26]:
# 데이터베이스 서버와의 연결을 종료
_db.close()